In [1]:
import pandas as pd
import numpy as np

In [7]:
hm = pd.Series([6, 7, 4, 3, 20], index = ["빅데이터분석가", "자영업", "웹개발자",
                                         "대학원", "합계"])

In [8]:
Hm = pd.DataFrame(hm)

In [9]:
Hm

          0
빅데이터분석가   6
자영업       7
웹개발자      4
대학원       3
합계       20

In [22]:
#딕셔너리로 만들기
df_dic = pd.DataFrame({"진로희망": ["빅데이터분석가", "자영업", "웹개발자", "대학원","합계"],
                        "인공지능반":[6, 7, 4, 3, 20]  
                      })

In [13]:
df_dic

      진로희망  도수
0  빅데이터분석가   6
1      자영업   7
2     웹개발자   4
3      대학원   3
4       합계  20

In [17]:
df_list = pd.DataFrame([["빅데이터분석가", 6],
                       ["자영업", 7],
                        ["웹개발자", 4],
                        ["대학원", 3],
                        ["합계", 20]],
                       columns = ["진로희망", "도수"])

In [19]:
df_list

      진로희망  도수
0  빅데이터분석가   6
1      자영업   7
2     웹개발자   4
3      대학원   3
4       합계  20

In [23]:
df_big = pd.DataFrame({"진로희망": ["빅데이터분석가", "자영업", "웹개발자", "대학원","합계"],
                        "빅데이터반":[12, 14, 10, 14, 50]  
                      })

In [24]:
df_big

      진로희망  빅데이터반
0  빅데이터분석가     12
1      자영업     14
2     웹개발자     10
3      대학원     14
4       합계     50

In [55]:
df = pd.concat([df_dic, df_big["빅데이터반"]], axis = 1)

In [58]:
df.columns = ["진로희망", "히잉", "헤응"]
df

      진로희망  히잉  헤응
0  빅데이터분석가   6  12
1      자영업   7  14
2     웹개발자   4  10
3      대학원   3  14
4       합계  20  50

In [60]:
df.columns = ["진로희망", "인공지능반", "빅데이터반"] #컬럼 이름 바꾸기
df

      진로희망  인공지능반  빅데이터반
0  빅데이터분석가      6     12
1      자영업      7     14
2     웹개발자      4     10
3      대학원      3     14
4       합계     20     50

In [61]:
df.set_index ("진로희망",inplace = True)

In [63]:
df

         인공지능반  빅데이터반
진로희망
빅데이터분석가      6     12
자영업          7     14
웹개발자         4     10
대학원          3     14
합계          20     50

In [64]:
df_merge = pd.merge(df_dic, df_big, on = "진로희망")    #merge 사용
df_merge

      진로희망  인공지능반  빅데이터반
0  빅데이터분석가      6     12
1      자영업      7     14
2     웹개발자      4     10
3      대학원      3     14
4       합계     20     50